[
    {
        "recipeName": "Tofu Steaks with Hemp Chimichurri",
        "directions": "Preheat oven to 400°F. Combine parsley, cilantro, hemp seeds, vinegar, lime juice, garlic, red pepper, 1/2 teaspoon salt, and 1/4 cup oil in a food processor; process until smooth. Set aside. Press tofu with paper towels until very dry. Slice each block in half diagonally. Stand each half on cut side, and split each into thirds, creating 12 equal triangles. Place in a single layer on paper towels. Combine garlic powder, onion powder, smoked paprika, cumin, black pepper, and remaining 1/2 teaspoon salt in a bowl. Rub spice mixture evenly on each side of tofu steaks. Spray steaks with cooking spray. Heat remaining 1 tablespoon oil in a grill pan over medium-high. Cook tofu steaks in single-layer batches until deep char marks appear, 3 to 5 minutes on each side. Transfer to a baking sheet. Bake tofu steaks at 400°F for 5 minutes. Place 2 tofu steaks on each of 6 plates. Top each serving with about 1 tablespoon herb mixture.",
        "lowCalories": "true",
        "vegan": "true",
        "lowCarb": "false",
        "lowSugar": "false",
        "glutenFree": "false",
        "dairyFree": "false",
        "highProtein": "false",
        "breakfast": "false",
        "lunch": "true",
        "dinner": "true"
    },
    {
        "recipeName": "Vegan Mac n Cheese",
        "directions": "To make the vegan mac & cheese powder: Add all of the ingredients to an air-tight container. Stir or shake well to combine. Store in your pantry until needed. Prepare vegan mac & cheese Cook the macaroni noodles according to package directions. Drain and rinse the pasta. Return the pot to the stove (heat off) and pour in the non-dairy milk and 1/4 cup of Homemade Vegan Mac & Cheese Powder and whisk together. Turn the heat back on to medium-high heat and whisk while cooking until the sauce thickens, 2 - 5 minutes. Add the cooked pasta to the pot along with the cheese sauce and stir to combine.",
        "lowCalories": "false",
        "vegan": "true",
        "lowCarb": "false",
        "lowSugar": "false",
        "glutenFree": "false",
        "dairyFree": "false",
        "highProtein": "false",
        "breakfast": "false",
        "lunch": "true",
        "dinner": "true"
    },
    {
        "recipeName": "Chicken Alfredo",
        "directions": "In a large skillet over medium-high heat, heat oil. Add chicken and season with salt and pepper. Cook until golden and cooked through, 8 minutes per side. Let rest 10 minutes, then slice. Add milk, broth, and garlic to skillet. Season with salt and pepper and bring to a simmer. Add fettuccine, stirring frequently for about 3 minutes. Let cook until al dente, 8 minutes more. Stir in heavy cream and Parmesan until combined. Simmer until sauce thickens. Remove from heat and stir in sliced chicken. Garnish with parsley.",
        "lowCalories": "true",
        "vegan": "false",
        "lowCarb": "true",
        "lowSugar": "false",
        "glutenFree": "false",
        "dairyFree": "false",
        "highProtein": "false",
        "breakfast": "false",
        "lunch": "true",
        "dinner": "true"
    },
    {
        "recipeName": "Hamburgers",
        "directions": "Divide the meat into four 6 ounce (170 gram) pucks about 1.25 inches thick by 3 inches wide. Try to handle the meat as little as possible and do not smash it together with your hands. Place the pucks on a wire rack and and refrigerate uncovered until you're ready to fry your burgers. This dries out the surface of the meat making it easier to get the crispy layer of browned meat on each side. Lightly oil a cast iron skillet or griddle by adding a little vegetable oil and spreading it around with a paper towel, soaking up any excess oil. Heat over medium high heat. While your pan is heating, salt and pepper both sides of your burgers. When your pan is hot, add a puck of meat and immediately top the meat with another smaller cast iron skillet or heavy pot and press down until the burger is your desired thickness. Leave the pot there while the burger cooks. The weight on top encourages meat to pan contact, which is how you get the crisp crust on your burger. If you're using a griddle and have room, repeat with the other patties. Let this fry until the burger is cooked 1/3 of the way up the sides and you can see a dark brown crust forming where the meat meets the pan. Remove the weight and flip the burger over. Top with a slice of cheese and continue to fry until the meat reaches your desired doneness (130 F for rare, 135 F for medium rare, 140 F for medium, and 150 F+ for well done). Keep in mind that hamburger is more prone to contamination than whole cuts of beef, so unless you really trust your butcher, you'll probably want to cook your burger to at least medium. To make the sauce, add the mayonnaise, ketchup, mustard, pickle, hot sauce and black pepper to a small food processor and puree until smooth. To construct your burger, toast your bun, and slather a generous amount of sauce onto the bottom bun. Top with onions and then the burger patty, then the tomatoes, and finally the lettuce and top bun. I use this order because the weight of the burger keeps the onion rings in place while the heat slightly cooks them. The cheese adheres to the tomatoes holding them in place, and the tomatoes act as an insulator, keeping the hot patty away from your lettuce so it does not wilt.",
        "lowCalories": "false",
        "vegan": "false",
        "lowCarb": "true",
        "lowSugar": "false",
        "glutenFree": "false",
        "dairyFree": "false",
        "highProtein": "false",
        "breakfast": "false",
        "lunch": "true",
        "dinner": "true"
    },
    {
        "recipeName": "Lasagna",
        "directions": "Cook noodles according to package directions; drain. Meanwhile, in a Dutch oven, cook sausage, beef and onion over medium heat 8-10 minutes or until meat is no longer pink, breaking up meat into crumbles. Add garlic; cook 1 minute. Drain. Stir in tomatoes, tomato paste, water, sugar, 3 tablespoons parsley, basil, fennel, 1/2 teaspoon salt and pepper; bring to a boil. Reduce heat; simmer, uncovered, 30 minutes, stirring occasionally. In a small bowl, mix egg, ricotta cheese, and remaining parsley and salt. Preheat oven to 375°. Spread 2 cups meat sauce into an ungreased 13x9-in. baking dish. Layer with three noodles and a third of the ricotta mixture. Sprinkle with 1 cup mozzarella cheese and 2 tablespoons Parmesan cheese. Repeat layers twice. Top with remaining meat sauce and cheeses (dish will be full). Bake, covered, 25 minutes. Bake, uncovered, 25 minutes longer or until bubbly. Let stand 15 minutes before serving.",
        "lowCalories": "true",
        "vegan": "false",
        "lowCarb": "false",
        "lowSugar": "true",
        "glutenFree": "false",
        "dairyFree": "false",
        "highProtein": "false",
        "breakfast": "false",
        "lunch": "true",
        "dinner": "true"
    },
    {
        "recipeName": "Cereal",
        "directions": "Put cereal in bowl. Pour milk over cereal. Enjoy",
        "lowCalories": "false",
        "vegan": "false",
        "lowCarb": "false",
        "lowSugar": "true",
        "glutenFree": "false",
        "dairyFree": "false",
        "highProtein": "false",
        "breakfast": "true",
        "lunch": "false",
        "dinner": "false"
    },
    {
        "recipeName": "Pot Pie",
        "directions": "Heat oven to 425°F. Prepare pie crusts as directed on box for Two-Crust Pie using 9-inch glass pie pan. In 2-quart saucepan, melt butter over medium heat. Add onion; cook 2 minutes, stirring frequently, until tender. Stir in flour, salt and pepper until well blended. Gradually stir in broth and milk, cooking and stirring until bubbly and thickened. Stir in chicken and mixed vegetables. Remove from heat. Spoon chicken mixture into crust-lined pan. Top with second crust; seal edge and flute. Cut slits in several places in top crust. Bake 30 to 40 minutes or until crust is golden brown. During last 15 to 20 minutes of baking, cover crust edge with strips of foil to prevent excessive browning. Let stand 5 minutes before serving.",
        "lowCalories": "true",
        "vegan": "false",
        "lowCarb": "false",
        "lowSugar": "false",
        "glutenFree": "true",
        "dairyFree": "false",
        "highProtein": "false",
        "breakfast": "false",
        "lunch": "true",
        "dinner": "true"
    },
    {
        "recipeName": "Oatmeal",
        "directions": "Boil water. Put oatmeal in bowl. Pour boiling water over oatmeal, let sit until oatmeal is soft.",
        "lowCalories": "false",
        "vegan": "false",
        "lowCarb": "false",
        "lowSugar": "false",
        "glutenFree": "true",
        "dairyFree": "false",
        "highProtein": "false",
        "breakfast": "true",
        "lunch": "false",
        "dinner": "false"
    },
    {
        "recipeName": "Chocolate Cake",
        "directions": "Prepare three 8 inch cake pans with parchment paper circles in the bottom, and grease the sides. Preheat oven to 300°F (148°C). Add all dry ingredients to a large bowl and whisk together. Add eggs, buttermilk and vegetable oil to the dry ingredients and mix well. Add vanilla to boiling water and add to mixture. Mix well. Divide batter evenly between cakes pans and bake for 30-33 minutes, or until a toothpick comes out with a few crumbs. Remove cakes from oven and allow to cool for about 10 minutes, then remove to cooling racks to cool completely. Make frosting while cakes cool. Beat together butter and shortening until smooth. Slowly add 4 cups (460g) of powdered sugar and mix until smooth. Add vanilla and half of the water or milk and mix until smooth. Add another 5 cups (575g) of powdered sugar and mix until smooth. Add cocoa and mix until smooth. Add remaining water or milk until the frosting is the right consistency. Once cakes are cool, remove cake domes from top with a large serrated knife. Place first layer of cake on cake plate. Spread about 1 cup of frosting on top in an even layer. Add second layer of cake and add another cup of frosting on top in an even layer. Add final layer of cake on top and frost the outside of the cake. Feel free to use my tutorial for frosting a smooth cake. To make the chocolate ganache, add the chocolate chips to a medium sized bowl. Heat the heavy whipping cream just until it begins to boil, then pour it over the chocolate chips. Allow it to sit for 2-3 minutes, then whisk until smooth. Drizzle the chocolate ganache around the edge of the cake, then pour the remainder of the ganache on top of the cake and spread evenly. I like to use a squeeze bottle for drizzling around the edges. Allow the ganache to firm up a bit, then pipe the remainder of the frosting around the top edge of the cake and pipe a border around the bottom. I used Ateco tip 844. Add a few sprinkles to the cake, if desired, then serve. Cake is best when well covered for 3-4 days.",
        "lowCalories": "true",
        "vegan": "false",
        "lowCarb": "false",
        "lowSugar": "false",
        "glutenFree": "false",
        "dairyFree": "true",
        "highProtein": "false",
        "breakfast": "false",
        "lunch": "false",
        "dinner": "true"
    },
    {
        "recipeName": "Meatballs",
        "directions": "Combine beef, veal, and pork in a large bowl. Add garlic, eggs, cheese, parsley, salt and pepper. Blend bread crumbs into meat mixture. Slowly add the water 1/2 cup at a time. The mixture should be very moist but still hold its shape if rolled into meatballs. (I usually use about 1 1/4 cups of water). Shape into meatballs. Heat olive oil in a large skillet. Fry meatballs in batches. When the meatball is very brown and slightly crisp remove from the heat and drain on a paper towel. If your mixture is too wet, cover the meatballs while they are cooking so that they hold their shape better.",
        "lowCalories": "false",
        "vegan": "false",
        "lowCarb": "false",
        "lowSugar": "false",
        "glutenFree": "false",
        "dairyFree": "true",
        "highProtein": "false",
        "breakfast": "false",
        "lunch": "false",
        "dinner": "true"
    },
    {
        "recipeName": "Chicken Soup",
        "directions": "Heat olive oil in a large skillet. Fry meatballs in batches. When the meatball is very brown and slightly crisp remove from the heat and drain on a paper towel. (If your mixture is too wet, cover the meatballs while they are cooking so that they hold their shape better.) Take everything out of the pot. Strain the broth. Pick the meat off of the bones and chop the carrots, celery and onion. Season the broth with salt, pepper and chicken bouillon to taste, if desired. Return the chicken, carrots, celery and onion to the pot, stir together, and serve.",
        "lowCalories": "true",
        "vegan": "false",
        "lowCarb": "false",
        "lowSugar": "false",
        "glutenFree": "false",
        "dairyFree": "false",
        "highProtein": "true",
        "breakfast": "false",
        "lunch": "true",
        "dinner": "true"
    },
    {
        "recipeName": "Waffles",
        "directions": "Preheat waffle iron. Beat eggs in large bowl with hand beater until fluffy. Beat in flour, milk, vegetable oil, sugar, baking powder, salt and vanilla, just until smooth. Spray preheated waffle iron with non-stick cooking spray. Pour mix onto hot waffle iron. Cook until golden brown. Serve hot.",
        "lowCalories": "false",
        "vegan": "false",
        "lowCarb": "false",
        "lowSugar": "false",
        "glutenFree": "false",
        "dairyFree": "false",
        "highProtein": "true",
        "breakfast": "true",
        "lunch": "false",
        "dinner": "false"
    },
    {
        "recipeName": "Pancakes",
        "directions": "Preheat pan. Beat eggs in large bowl with hand beater until fluffy. Beat in flour, milk, vegetable oil, sugar, baking powder, salt and vanilla, just until smooth. Spray preheated pan with non-stick cooking spray. Pour mix onto hot pan. Cook until golden brown. Serve hot.",
        "lowCalories": "true",
        "vegan": "true",
        "lowCarb": "false",
        "lowSugar": "false",
        "glutenFree": "false",
        "dairyFree": "true",
        "highProtein": "false",
        "breakfast": "true",
        "lunch": "false",
        "dinner": "false"
    },
    {
        "recipeName": "Chips and Dip",
        "directions": "Buy chips, buy dip, dip yo'chip in da'dip!",
        "lowCalories": "true",
        "vegan": "true",
        "lowCarb": "false",
        "lowSugar": "true",
        "glutenFree": "false",
        "dairyFree": "true",
        "highProtein": "false",
        "breakfast": "false",
        "lunch": "true",
        "dinner": "false"
    },
    {
        "recipeName": "Chicken Wrap",
        "directions": "Lay tortillas on a clean flat surface. Place about 1/2 cup chicken, 1 tablespoon ranch, 2 tablespoons of cheese, and 1 tablespoon of minced cilantro on each tortilla. Fold tightly to form a burrito shape. Heat a heavy-duty pan or grill to medium heat. Coat with a light layer or oil or cooking spray and cook wraps for 1-2 minutes on each side or until the tortilla is crispy and golden. Remove from heat, slice in half and serve immediately.",
        "lowCalories": "true",
        "vegan": "false",
        "lowCarb": "true",
        "lowSugar": "true",
        "glutenFree": "false",
        "dairyFree": "true",
        "highProtein": "true",
        "breakfast": "false",
        "lunch": "true",
        "dinner": "true"
    },
    {
        "recipeName": "Cheeseburgers",
        "directions": "Divide the meat into four 6 ounce (170 gram) pucks about 1.25 inches thick by 3 inches wide. Try to handle the meat as little as possible and do not smash it together with your hands. Place the pucks on a wire rack and and refrigerate uncovered until you're ready to fry your burgers. This dries out the surface of the meat making it easier to get the crispy layer of browned meat on each side. Lightly oil a cast iron skillet or griddle by adding a little vegetable oil and spreading it around with a paper towel, soaking up any excess oil. Heat over medium high heat. While your pan is heating, salt and pepper both sides of your burgers. When your pan is hot, add a puck of meat and immediately top the meat with another smaller cast iron skillet or heavy pot and press down until the burger is your desired thickness. Leave the pot there while the burger cooks. The weight on top encourages meat to pan contact, which is how you get the crisp crust on your burger. If you're using a griddle and have room, repeat with the other patties. Let this fry until the burger is cooked 1/3 of the way up the sides and you can see a dark brown crust forming where the meat meets the pan. Remove the weight and flip the burger over. Top with a slice of cheese and continue to fry until the meat reaches your desired doneness (130 F for rare, 135 F for medium rare, 140 F for medium, and 150 F+ for well done). Keep in mind that hamburger is more prone to contamination than whole cuts of beef, so unless you really trust your butcher, you'll probably want to cook your burger to at least medium. To make the sauce, add the mayonnaise, ketchup, mustard, pickle, hot sauce and black pepper to a small food processor and puree until smooth. To construct your burger, toast your bun, and slather a generous amount of sauce onto the bottom bun. Top with onions and then the burger patty, then the tomatoes, and finally the lettuce and top bun. I use this order because the weight of the burger keeps the onion rings in place while the heat slightly cooks them. The cheese adheres to the tomatoes holding them in place, and the tomatoes act as an insulator, keeping the hot patty away from your lettuce so it does not wilt.",
        "lowCalories": "false",
        "vegan": "false",
        "lowCarb": "false",
        "lowSugar": "false",
        "glutenFree": "false",
        "dairyFree": "false",
        "highProtein": "true",
        "breakfast": "false",
        "lunch": "true",
        "dinner": "true"
    },
    {
        "recipeName": "Smoothie",
        "directions": "Desired fruit, ice, water, milk, blend it all together on 'Smooth' button.",
        "lowCalories": "true",
        "vegan": "false",
        "lowCarb": "true",
        "lowSugar": "true",
        "glutenFree": "true",
        "dairyFree": "false",
        "highProtein": "false",
        "breakfast": "true",
        "lunch": "true",
        "dinner": "true"
    },
    {
        "recipeName": "Fruit Platter",
        "directions": "Slice desired fruit, arrange in an eye pleasing manner on a plate.",
        "lowCalories": "true",
        "vegan": "true",
        "lowCarb": "true",
        "lowSugar": "true",
        "glutenFree": "true",
        "dairyFree": "true",
        "highProtein": "false",
        "breakfast": "true",
        "lunch": "true",
        "dinner": "true"
    },
    {
        "recipeName": "Cheese Platter",
        "directions": "Slice desired cheese, arrange in an eye pleasing manner on a plate.",
        "lowCalories": "false",
        "vegan": "false",
        "lowCarb": "true",
        "lowSugar": "true",
        "glutenFree": "true",
        "dairyFree": "false",
        "highProtein": "false",
        "breakfast": "false",
        "lunch": "true",
        "dinner": "true"
    },
    {
        "recipeName": "Stir Fry",
        "directions": "Cut the chicken thighs (or breast) into bite-sized pieces and cook. Cook vegetables until desired tenderness. Prepare easy sweet and savory stir fry sauce. Combine the chicken with the vegetables and sauce. Simmer until sauce thickens and ingredients are well incorporated.",
        "lowCalories": "false",
        "vegan": "false",
        "lowCarb": "false",
        "lowSugar": "false",
        "glutenFree": "false",
        "dairyFree": "false",
        "highProtein": "true",
        "breakfast": "false",
        "lunch": "true",
        "dinner": "true"
    },
    {
        "recipeName": "Ramen",
        "directions": "Whisk together the ¼ cup of soy sauce, ¼ cup of rice vinegar and ¾ cup water, set aside. Prepare an ice bath by filling a bowl with ice and water. Bring a pot of water to boil (make sure there is enough water to cover the eggs). When boiling, carefully lower the eggs into the water using a slotted spoon or spider. Reduce heat if necessary to keep the water just barely boiling. Cook for seven minutes, then remove from pot and place eggs in the ice bath. Leave in the ice bath for 3 minutes. Remove from ice bath and gently peel (egg will be soft). Place peeled eggs in the marinade and make sure they are completely covered with the marinade. Leave in the marinade for several hours or overnight. If keeping longer, discard the marinade and store in the refrigerator up to 3 days. Reheat the egg in the ramen broth (don't leave in the broth very long before serving or the egg will overcook). Bring a pot of water to a boil. When boiling, add the noodles and simmer for 3 minutes. Strain and rinse with cold water. Toss with just a little oil if necessary to keep them from sticking (mine already had a little oil on them, so I didn't need to). Set aside. Heat a large pot or dutch oven over medium high heat. Add the onion and saute until starting to soften, about 5 minutes. Add the sliced mushrooms and saute for another 2-3 minutes. Add the garlic and ginger and stir fry for about 30 seconds, just until fragrant so that they don't burn. Add the chicken broth and 1 cup of water, soy sauce, rice vinegar, oyster sauce, fish sauce, chili garlic sauce, stir to combine. Bring back to a simmer. When broth reaches a simmer, add the chicken thighs. Simmer for 15-20 minutes until chicken is cooked through and reaches a temperature of 165 degrees. Remove the chicken and shred it with two forks. Add it back to the broth along with the bok choy and cook for 3-5 minutes. Remove from heat and serve. In a bowl, place a serving of noodles, then pour the soup over them. Top soup with ramen egg, sliced green onions, cilantro and sesame seeds if desired.",
        "lowCalories": "true",
        "vegan": "false",
        "lowCarb": "false",
        "lowSugar": "true",
        "glutenFree": "false",
        "dairyFree": "false",
        "highProtein": "true",
        "breakfast": "false",
        "lunch": "true",
        "dinner": "true"
    },
    {
        "recipeName": "Cucumber Salad",
        "directions": "Slice the cucumber in half and then in slices. Slice the onion in thin stripes. Mix cucumber and onions in a large bowl. Season with salt and pepper. Mix white wine vinegar, water, sugar in a small bowl. Pour over the cucumbers and onions, and stir well. Sprinkle some fresh chopped dill and stir.",
        "lowCalories": "true",
        "vegan": "true",
        "lowCarb": "true",
        "lowSugar": "true",
        "glutenFree": "true",
        "dairyFree": "true",
        "highProtein": "false",
        "breakfast": "false",
        "lunch": "true",
        "dinner": "true"
    },
    {
        "recipeName": "Rice Noodles",
        "directions": "Cover noodles in hot water while preparing the other ingredients. Heat a pot of water until steam rises. Put all but a tablespoon of the oil in a wok or large skillet, and turn heat to high. When it smokes, add the chicken, and stir until it loses its color; it doesn't cook through. Remove with slotted spoon. Add bean sprouts, peas and shiitakes. Stir until wilted and beginning to brown. Add sauces and wine. Remove from the pan. Drain noodles, and dip them in the boiling water with tongs or in a strainer for about 5 seconds. Drain. Add remaining oil and the egg to pan, still over high heat. Stir to scramble. Add drained noodles and cooked ingredients, and toss, lifting (scrape, if necessary) repeatedly until all are mixed together and hot. Garnish, and serve.",
        "lowCalories": "true",
        "vegan": "true",
        "lowCarb": "false",
        "lowSugar": "false",
        "glutenFree": "true",
        "dairyFree": "true",
        "highProtein": "falsee",
        "breakfast": "false",
        "lunch": "true",
        "dinner": "true"
    },
    {
        "recipeName": "French Fries",
        "directions": "Peel and rinse the potatoes. Then cut them into sticks by cutting the potato in 4 or 5 vertical pieces, and then cutting each piece into sticks. Place them in a large bowl and cover with cold water. Allow them to soak, 2 to 3 hours. (You can also stick them in the fridge and let them soak overnight.)  When you're ready to make the fries, drain off the water and lay the potatoes on 2 baking sheets lined with paper towels. Blot with paper towels to dry them.  Heat a few inches of oil in a heavy pot to 300 degrees F. In 3 or 4 batches, cook the potatoes until soft, 4 to 5 minutes per batch. They should not be brown at this point! You just want to start the cooking process. Remove each batch and drain on new/dry paper towels. Once all the potatoes have been fried at 300 degrees F, turn up the heat until the oil reaches 400 degrees F. When the oil's hot, start frying the potatoes in batches again, cooking until the fries are golden and crisp. Remove the potatoes from the oil and drain on paper towels. Sprinkle with sea salt and dive in!",
        "lowCalories": "false",
        "vegan": "true",
        "lowCarb": "false",
        "lowSugar": "true",
        "glutenFree": "true",
        "dairyFree": "true",
        "highProtein": "false",
        "breakfast": "false",
        "lunch": "true",
        "dinner": "true"
    }
]